flapping_plate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
  (-0.3  -0.15   -0.5)
  (-0.3   0.15   -0.5)
  ( 0.3  -0.15   -0.5)
  ( 0.3   0.15   -0.5)
  (-0.3  -0.15    0.5)
  (-0.3   0.15    0.5)
  ( 0.3  -0.15    0.5)
  ( 0.3   0.15    0.5)
);
blocks
(

hex ( 0 2 3 1 4 6 7 5 )   ( 1000 500 1) simpleGrading (1 1 1)
);
edges();

boundary
(
front
{
	type empty;
	faces (
		( 4 6 7 5 )
	);
}
back
{
	type empty;
	faces (
		( 0 2 3 1 )
	);
}
top
{
  type wall;
	faces (
		( 1 3 7 5 )
	);
}
bottom
{
  type wall;
	faces (
		( 0 2 6 4 )
	);
}
right
{
	type wall;
	faces (
		( 2 3 7 6 )
	);
}
left
{
	type wall;
	faces (
		( 0 1 5 4 )
	);
}
);
mergePatchPairs
(
);

