flapping_plate/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // inlet
    // {
    //     type            fixedValue;
    //     value           uniform (0 0 0);
    // }

    // outlet
    // {
    //     type            zeroGradient;
    // }
    // side1
    // {
    //     type            fixedValue;
    //     value           uniform (0 0 0);
    // }
    // side2
    // {
    //     type            fixedValue;
    //     value           uniform (0 0 0);
    // }
    /* side1 { type            cyclic; } */
    /* side2 { type            cyclic; } */
    front {type empty;}
    back {type empty;}
    
    
    "(top|bottom|left|right)"
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }
}

// ************************************************************************* //
