flapping_plate/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // inlet
    // {
    //     type            zeroGradient;
    // }

    // outlet
    // {
    //     type            fixedValue;
    //     value uniform 0;
    // }

    // side1 { type        zeroGradient; }
    // side2 { type        zeroGradient; }
    front {type empty;}
    back {type empty;}
    
    "(top|bottom|left|right)"
    {
        type            totalPressure;
        p0              uniform 0;
        value           $internalField;
    }

}

// ************************************************************************* //
