flapping_plate/0_org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    // inlet
    // {
    //     type  fixedValue;
    //     value uniform 0;
    // }

    // outlet
    // {
    //     type zeroGradient;
    // }

    // side1 {type        zeroGradient; }
    // side2 {type        zeroGradient; }
    front {type empty;}
    back  {type empty;}
    
    "(top|bottom|left|right)"
    {
        type            inletOutlet;
        inletValue      uniform 300;
    }
}

// ************************************************************************* //
